LONG_NAME=Kafka \u7684\u901A\u7528\u7EC4\u4EF6
HELP=org.talend.esb.help.cKafka
BROKER_LIST.NAME=\u4EE3\u7406\u5217\u8868
BROKER_LIST.DESCRIPTION=\u8981\u4F7F\u7528\u7684 Kafka \u4EE3\u7406\u7684 URL\u3002\u683C\u5F0F\u662F\u4E3B\u673A 1\uFF1A\u7AEF\u53E3 1\uFF0C\u4E3B\u673A 2 \uFF1A\u7AEF\u53E3 2\uFF0C\u5217\u8868\u53EF\u4EE5\u662F\u4EE3\u7406\u5B50\u96C6\uFF0C\u4E5F\u53EF\u4EE5\u662F\u6307\u5411\u4EE3\u7406\u5B50\u96C6\u7684 VIP\u3002\n \u6B64\u9009\u9879\u5728 Kafka \u6587\u6863\u4E2D\u79F0\u4E3A bootstrap.servers
CLIENT_ID.NAME=\u5BA2\u6237\u7AEF ID
CLIENT_ID.DESCRIPTION=\u5BA2\u6237\u7AEF ID \u662F\u4E00\u4E2A\u7528\u6237\u6307\u5B9A\u7684\u5B57\u7B26\u4E32\uFF0C\u5728\u6BCF\u6B21\u8BF7\u6C42\u4E2D\u53D1\u9001\uFF0C\u7528\u4E8E\u8FFD\u8E2A\u8C03\u7528\u3002 \n\u5B83\u5E94\u4ECE\u903B\u8F91\u4E0A\u8BC6\u522B\u53D1\u9001\u8BF7\u6C42\u7684\u5E94\u7528\u7A0B\u5E8F\u3002
TOPIC.NAME=\u4E3B\u9898
TOPIC.DESCRIPTION=\u4E3B\u9898\u540D\u79F0
GROUP_ID.NAME=\u7EC4 ID
GROUP_ID.DESCRIPTION=\u4E00\u4E2A\u5B57\u7B26\u4E32\uFF0C\u662F\u4F7F\u7528\u8005\u6240\u5C5E\u4F7F\u7528\u8005\u8FDB\u7A0B\u7EC4\u7684\u552F\u4E00\u6027\u6807\u8BC6\u3002 \n\u901A\u8FC7\u8BBE\u7F6E\u76F8\u540C\u7684\u7EC4 ID\uFF0C\u53EF\u8868\u660E\u591A\u4E2A\u8FDB\u7A0B\u5C5E\u4E8E\u540C\u4E00\u4E2A\u4F7F\u7528\u8005\u7EC4\u3002
PARTITIONER.NAME=\u5206\u533A\u5668
PARTITIONER.DESCRIPTION=\u5206\u533A\u5668\u7C7B\uFF0C\u7528\u4E8E\u5728\u5B50\u4E3B\u9898\u4E4B\u95F4\u5BF9\u6D88\u606F\u8FDB\u884C\u5206\u533A\u3002 \n\u9ED8\u8BA4\u5206\u533A\u5668\u57FA\u4E8E\u5BC6\u94A5\u7684\u54C8\u5E0C\u503C\u3002
URI_OPTIONS.NAME=Kafka \u5C5E\u6027
URI_OPTIONS.ITEM.NAME=\u540D\u79F0
URI_OPTIONS.ITEM.VALUE=\u503C
COMPRESSION_CODEC.NAME=\u538B\u7F29\u7F16\u89E3\u7801\u5668
COMPRESSION_CODEC.DESCRIPTION=\u4F7F\u7528\u6B64\u53C2\u6570\uFF0C\u60A8\u53EF\u4EE5\u4E3A\u8BE5\u751F\u6210\u5668\u751F\u6210\u7684\u6240\u6709\u6570\u636E\u6307\u5B9A\u538B\u7F29\u7F16\u89E3\u7801\u5668\u3002 \n\u6709\u6548\u503C\u4E3A\u65E0\u3001gzip\u3001snappy\u3001lz4 \u548C zstd\u3002
COMPRESSION_CODEC.ITEM.NONE=\u65E0
COMPRESSION_CODEC.ITEM.GZIP=GZIP
COMPRESSION_CODEC.ITEM.SNAPPY=snappy
COMPRESSION_CODEC.ITEM.LZ4=LZ4
REQUEST_REQUIRED_ACKS.NAME=\u8BF7\u6C42\u6240\u9700\u786E\u8BA4
REQUEST_REQUIRED_ACKS.DESCRIPTION=\u751F\u6210\u5668\u5728\u8BA4\u4E3A\u8BF7\u6C42\u5B8C\u6210\u4E4B\u524D\u8981\u6C42 leader (\u9886\u5BFC\u8005) \u6536\u5230\u7684\u786E\u8BA4\u6B21\u6570\u3002 \n\u8FD9\u63A7\u5236\u6240\u53D1\u9001\u8BB0\u5F55\u7684\u6301\u4E45\u6027\u3002 \n\u5141\u8BB8\u4EE5\u4E0B\u8BBE\u7F6E\uFF1A acks=0 \u5982\u679C\u8BBE\u7F6E\u4E3A\u96F6\uFF0C\u5219\u751F\u6210\u5668\u4E0D\u7B49\u5F85\u670D\u52A1\u5668\u7684\u4EFB\u4F55\u786E\u8BA4\u3002 \n\u8BB0\u5F55\u5C06\u7ACB\u5373\u6DFB\u52A0\u5230\u5957\u63A5\u5B57\u7F13\u51B2\u533A\uFF0C\u5E76\u88AB\u8BA4\u4E3A\u5DF2\u53D1\u9001\u3002 \n\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u65E0\u6CD5\u4FDD\u8BC1\u670D\u52A1\u5668\u5DF2\u6536\u5230\u8BB0\u5F55\uFF0C\u91CD\u8BD5\u914D\u7F6E\u4E5F\u4E0D\u4F1A\u751F\u6548 (\u56E0\u4E3A\u5BA2\u6237\u7AEF\u901A\u5E38\u4E0D\u4F1A\u77E5\u9053\u4EFB\u4F55\u5931\u8D25)\u3002\n \u6BCF\u6761\u8BB0\u5F55\u7684\u8FD4\u56DE\u504F\u79FB\u91CF\u59CB\u7EC8\u8BBE\u7F6E\u4E3A -1\u3002 \nacks=1 \u8FD9\u8868\u793A\u9886\u5BFC\u8005\u4F1A\u5C06\u8BB0\u5F55\u5199\u5165\u5176\u672C\u5730\u65E5\u5FD7\uFF0C\u4F46\u4F1A\u5728\u672A\u7B49\u5F85\u6240\u6709 follower (\u8FFD\u968F\u8005) \u5B8C\u5168\u786E\u8BA4\u7684\u60C5\u51B5\u4E0B\u4F5C\u51FA\u54CD\u5E94\u3002 \n\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u5982\u679C\u9886\u5BFC\u8005\u5728\u786E\u8BA4\u8BB0\u5F55\u540E\uFF0C\u4F46\u5728\u8FFD\u968F\u8005\u590D\u5236\u8BB0\u5F55\u4E4B\u524D\u5931\u8D25\uFF0C\u90A3\u4E48\u8BB0\u5F55\u5C31\u4F1A\u4E22\u5931\u3002 \nacks=all \u8FD9\u8868\u793A\u9886\u5BFC\u8005\u5C06\u7B49\u5F85\u6240\u6709\u540C\u6B65\u526F\u672C\u786E\u8BA4\u6536\u5230\u8BB0\u5F55\u3002 \n\u8FD9\u4FDD\u8BC1\u4E86\u53EA\u8981\u81F3\u5C11\u4E00\u4E2A\u540C\u6B65\u526F\u672C\u670D\u52A1\u5668\u4ECD\u4FDD\u6301\u6D3B\u52A8\u72B6\u6001\uFF0C\u8BB0\u5F55\u5C31\u4E0D\u4F1A\u4E22\u5931\u3002 \n\u8FD9\u662F\u6700\u5F3A\u6709\u529B\u7684\u4FDD\u8BC1\uFF0C\u76F8\u5F53\u4E8E acks=-1 \u7684\u8BBE\u7F6E\u3002 \n\u8BF7\u6CE8\u610F\uFF0C\u542F\u7528 idempotence \u9700\u8981\u6B64\u914D\u7F6E\u503C\u4E3A "all"\u3002\u5982\u679C\u8BBE\u7F6E\u7684\u914D\u7F6E\u76F8\u4E92\u51B2\u7A81\uFF0C\u4E14\u672A\u660E\u786E\u542F\u7528 idempotence\uFF0C\u5219\u4F1A\u7981\u7528 idempotence\u3002
REQUEST_REQUIRED_ACKS.ITEM.MINUS_ONE=-1
REQUEST_REQUIRED_ACKS.ITEM.ZERO=0
REQUEST_REQUIRED_ACKS.ITEM.ONE=1
REQUEST_REQUIRED_ACKS.ITEM.ALL=\u6240\u6709
RETRY_BACKOFF_MS.NAME=\u91CD\u8BD5\u56DE\u9000 (\u6BEB\u79D2)
RETRY_BACKOFF_MS.DESCRIPTION=\u6BCF\u6B21\u91CD\u8BD5\u524D\uFF0C\u751F\u6210\u5668\u90FD\u4F1A\u5237\u65B0\u76F8\u5173\u4E3B\u9898\u7684\u5143\u6570\u636E\uFF0C\u67E5\u770B\u662F\u5426\u9009\u51FA\u4E86\u65B0\u7684\u9886\u5BFC\u8005\u3002 \n\u7531\u4E8E\u9009\u51FA\u9886\u5BFC\u8005\u9700\u8981\u4E00\u4E9B\u65F6\u95F4\uFF0C\u8BE5\u5C5E\u6027\u6307\u5B9A\u4E86\u751F\u6210\u5668\u5728\u5237\u65B0\u5143\u6570\u636E\u524D\u7684\u7B49\u5F85\u65F6\u95F4\u3002
SEND_BUFFER_BYTES.NAME=\u53D1\u9001\u7F13\u51B2\u533A (\u5B57\u8282)
SEND_BUFFER_BYTES.DESCRIPTION=\u5957\u63A5\u5B57\u5199\u5165\u7F13\u51B2\u533A\u5927\u5C0F\u3002
REQUEST_TIMEOUT_MS.NAME=\u8BF7\u6C42\u8D85\u65F6 (\u6BEB\u79D2)
REQUEST_TIMEOUT_MS.DESCRIPTION=\u5728\u5411\u5BA2\u6237\u7AEF\u53D1\u56DE\u9519\u8BEF\u4FE1\u606F\u4E4B\u524D\uFF0C\u4EE3\u7406\u4E3A\u6EE1\u8DB3 request.required.acks \u8981\u6C42\u800C\u7B49\u5F85\u7684\u65F6\u95F4\u3002
SERIALIZER_CLASS.NAME=\u5E8F\u5217\u5316\u7A0B\u5E8F\u7C7B
SERIALIZER_CLASS.DESCRIPTION=\u6D88\u606F\u7684\u5E8F\u5217\u5316\u7A0B\u5E8F\u7C7B\u3002
KEY_SERIALIZER_CLASS.NAME=\u5BC6\u94A5\u5E8F\u5217\u5316\u7A0B\u5E8F\u7C7B
KEY_SERIALIZER_CLASS.DESCRIPTION=\u952E\u7684\u5E8F\u5217\u5316\u7A0B\u5E8F\u7C7B (\u5982\u679C\u672A\u7ED9\u51FA\uFF0C\u5219\u9ED8\u8BA4\u4E0E\u6D88\u606F\u7684\u5E8F\u5217\u5316\u7A0B\u5E8F\u7C7B\u76F8\u540C)\u3002
AUTO_COMMIT_ENABLE.NAME=\u542F\u7528\u81EA\u52A8\u63D0\u4EA4
AUTO_COMMIT_ENABLE.DESCRIPTION=\u5982\u679C\u4E3A "true"\uFF0C\u5219\u4F1A\u5B9A\u671F\u5411 ZooKeeper \u63D0\u4EA4\u4F7F\u7528\u8005\u5DF2\u83B7\u53D6\u6D88\u606F\u7684\u504F\u79FB\u91CF\u3002 \n\u8FDB\u7A0B\u5931\u8D25\u65F6\uFF0C\u6B64\u63D0\u4EA4\u7684\u504F\u79FB\u91CF\u5C06\u4F5C\u4E3A\u65B0\u4F7F\u7528\u8005\u7684\u8D77\u59CB\u4F4D\u7F6E\u3002
AUTO_COMMIT_INTERVAL_MS.NAME=\u81EA\u52A8\u63D0\u4EA4\u95F4\u9694 (\u6BEB\u79D2)
AUTO_COMMIT_INTERVAL_MS.DESCRIPTION=\u5411 zookeeper \u63D0\u4EA4\u4F7F\u7528\u8005\u504F\u79FB\u91CF\u7684\u9891\u7387 (\u6BEB\u79D2)\u3002
FETCH_MIN_BYTES.NAME=\u6700\u5C0F\u6293\u53D6\u5927\u5C0F (\u5B57\u8282)
FETCH_MIN_BYTES.DESCRIPTION=\u670D\u52A1\u5668\u4E3A\u6293\u53D6\u8BF7\u6C42\u8FD4\u56DE\u7684\u6700\u5C0F\u6570\u636E\u91CF\u3002 \n\u5982\u679C\u53EF\u7528\u6570\u636E\u4E0D\u8DB3\uFF0C\u8BF7\u6C42\u5C06\u7B49\u5F85\u79EF\u7D2F\u8DB3\u591F\u591A\u7684\u6570\u636E\u540E\u518D\u54CD\u5E94\u8BF7\u6C42\u3002
FETCH_WAIT_MAX_MS.NAME=\u6293\u53D6\u6700\u5927\u7B49\u5F85\u65F6\u95F4 (\u6BEB\u79D2)
FETCH_WAIT_MAX_MS.DESCRIPTION=\u5982\u679C\u6CA1\u6709\u8DB3\u591F\u7684\u6570\u636E\u7ACB\u5373\u6EE1\u8DB3 fetch.min.bytes \u7684\u8981\u6C42\uFF0C\u670D\u52A1\u5668\u5728\u54CD\u5E94\u6293\u53D6\u8BF7\u6C42\u524D\u963B\u585E\u7684\u6700\u957F\u65F6\u95F4\u3002
AUTO_OFFSET_RESET.NAME=\u81EA\u52A8\u91CD\u7F6E\u504F\u79FB
AUTO_OFFSET_RESET.DESCRIPTION=\u5F53 ZooKeeper \u4E2D\u6CA1\u6709\u521D\u59CB\u504F\u79FB\u91CF\u6216\u504F\u79FB\u91CF\u8D85\u51FA\u8303\u56F4\u65F6\u600E\u4E48\u529E\uFF1A \n\u6700\u65E9\uFF1A\u81EA\u52A8\u5C06\u504F\u79FB\u91CF\u91CD\u7F6E\u4E3A\u6700\u65E9\u7684\u504F\u79FB\u91CF \n\u6700\u65B0\uFF1A\u81EA\u52A8\u5C06\u504F\u79FB\u91CF\u91CD\u7F6E\u4E3A\u6700\u65B0\u504F\u79FB\u91CF \n\u5931\u8D25\uFF1A\u5411\u4F7F\u7528\u8005\u629B\u51FA\u5F02\u5E38\u3002
AUTO_OFFSET_RESET.ITEM.LATEST=LATEST
AUTO_OFFSET_RESET.ITEM.EARLIEST=EARLIEST
AUTO_OFFSET_RESET.ITEM.NONE=\u65E0
SSL.NAME=SSL
SSL_KEY_PASSWORD.NAME=SSL \u5BC6\u94A5\u5BC6\u7801
SSL_KEY_PASSWORD.DESCRIPTION=\u5BC6\u94A5\u5E93\u6587\u4EF6\u4E2D\u79C1\u94A5\u7684\u5BC6\u7801\u6216\u5728 sslKeystoreKey \u4E2D\u6307\u5B9A\u7684 PEM \u5BC6\u94A5\u3002 \n\u53EA\u6709\u5728\u914D\u7F6E\u4E86\u53CC\u5411\u8EAB\u4EFD\u9A8C\u8BC1\u7684\u60C5\u51B5\u4E0B\uFF0C\u5BA2\u6237\u7AEF\u624D\u9700\u8981\u8FD9\u6837\u505A\u3002
SSL_KEYSTORE_LOCATION.NAME=SSL \u5BC6\u94A5\u5E93\u4F4D\u7F6E
SSL_KEYSTORE_LOCATION.DESCRIPTION=\u5BC6\u94A5\u5E93\u6587\u4EF6\u7684\u4F4D\u7F6E\u3002\u8FD9\u662F\u5BA2\u6237\u7AEF\u7684\u53EF\u9009\u9879\uFF0C\u53EF\u7528\u4E8E\u5BA2\u6237\u7AEF\u7684\u53CC\u5411\u8EAB\u4EFD\u9A8C\u8BC1\u3002
SSL_KEYSTORE_PASSWORD.NAME=SSL \u5BC6\u94A5\u5E93\u5BC6\u7801
SSL_KEYSTORE_PASSWORD.DESCRIPTION=\u5BC6\u94A5\u5E93\u6587\u4EF6\u7684\u5E93\u5BC6\u7801\u3002\u8FD9\u662F\u5BA2\u6237\u7AEF\u7684\u53EF\u9009\u9879\uFF0C\u53EA\u6709\u5728\u914D\u7F6E\u4E86 "sslKeystoreLocation" \u65F6\u624D\u9700\u8981\u3002 \n\u5BC6\u94A5\u5E93\u5BC6\u7801\u4E0D\u652F\u6301 PEM \u683C\u5F0F\u3002
SSL_TRUSTSTORE_LOCATION.NAME=SSL \u4FE1\u4EFB\u5E93\u4F4D\u7F6E
SSL_TRUSTSTORE_LOCATION.DESCRIPTION=\u4FE1\u4EFB\u5E93\u6587\u4EF6\u7684\u4F4D\u7F6E\u3002
SSL_TRUSTSTORE_PASSWORD.NAME=SSL \u4FE1\u4EFB\u5E93\u5BC6\u7801
SSL_TRUSTSTORE_PASSWORD.DESCRIPTION=\u4FE1\u4EFB\u5E93\u6587\u4EF6\u7684\u5BC6\u7801\u3002\u5982\u679C\u672A\u8BBE\u7F6E\u5BC6\u7801\uFF0C\u5219\u4ECD\u5C06\u4F7F\u7528\u5DF2\u914D\u7F6E\u7684\u4FE1\u4EFB\u5E93\u6587\u4EF6\uFF0C\u4F46\u4F1A\u7981\u7528\u5B8C\u6574\u6027\u68C0\u67E5\u3002 \n\u4FE1\u4EFB\u5E93\u5BC6\u7801\u4E0D\u652F\u6301 PEM \u683C\u5F0F\u3002
SSL_CIPHER_SUITS.NAME=SSL \u5BC6\u7801\u5957\u4EF6
SSL_CIPHER_SUITS.DESCRIPTION=\u5BC6\u7801\u5957\u4EF6\u5217\u8868\u3002\u8FD9\u662F\u8BA4\u8BC1\u3001\u52A0\u5BC6\u3001MAC \u548C\u5BC6\u94A5\u4EA4\u6362\u7B97\u6CD5\u7684\u547D\u540D\u7EC4\u5408\uFF0C \n\u7528\u4E8E\u534F\u5546\u4F7F\u7528 TLS \u6216 SSL \u7F51\u7EDC\u534F\u8BAE\u7684\u7F51\u7EDC\u8FDE\u63A5\u7684\u5B89\u5168\u8BBE\u7F6E\u3002 \n\u9ED8\u8BA4\u652F\u6301\u6240\u6709\u53EF\u7528\u7684\u5BC6\u7801\u5957\u4EF6\u3002
SSL_ENDPOINT_ALGORITHM.NAME=SSL \u7AEF\u70B9\u7B97\u6CD5
SSL_ENDPOINT_ALGORITHM.DESCRIPTION=\u4F7F\u7528\u670D\u52A1\u5668\u8BC1\u4E66\u9A8C\u8BC1\u670D\u52A1\u5668\u4E3B\u673A\u540D\u7684\u7AEF\u70B9\u8BC6\u522B\u7B97\u6CD5\u3002 \n\u4F7F\u7528 none \u6216 false \u53EF\u7981\u7528\u670D\u52A1\u5668\u4E3B\u673A\u540D\u9A8C\u8BC1\u3002
SASL.NAME=SASL
SASL_KERBEROS_SERVICE_NAME.NAME=Kerberos \u670D\u52A1\u540D\u79F0
SASL_KERBEROS_SERVICE_NAME.DESCRIPTION=Kafka \u8FD0\u884C\u65F6\u4F7F\u7528\u7684 Kerberos \u4E3B\u4F53\u540D\u79F0\u3002\u8FD9\u53EF\u4EE5\u5728 Kafka \u7684 JAAS \u914D\u7F6E\u6216 Kafka \u7684\u914D\u7F6E\u4E2D\u5B9A\u4E49\u3002
SECURITY_PROTOCOL.NAME=\u5B89\u5168\u534F\u8BAE
SECURITY_PROTOCOL.DESCRIPTION=\u7528\u4E8E\u4E0E\u4EE3\u7406\u8FDB\u884C\u901A\u4FE1\u7684\u534F\u8BAE\u3002\u652F\u6301 SASL_PLAINTEXT\u3001PLAINTEXT\u3001SASL_SSL \u548C SSL\u3002
SECURITY_PROTOCOL.ITEM.PLAINTEXT=\u7EAF\u6587\u672C
SECURITY_PROTOCOL.ITEM.SSL=SSL
SECURITY_PROTOCOL.ITEM.SASL_PLAINTEXT=\u7ECF\u7EAF\u6587\u672C\u7684 SASL
SECURITY_PROTOCOL.ITEM.SASL_SSL=\u7ECF SSL \u7684 SASL
HEARTBEAT_INTERVAL_MS.NAME=\u68C0\u6D4B\u4FE1\u53F7\u95F4\u9694 (\u6BEB\u79D2)
HEARTBEAT_INTERVAL_MS.DESCRIPTION=\u4F7F\u7528 Kafka \u7684\u5206\u7EC4\u7BA1\u7406\u8BBE\u65BD\u65F6\uFF0C\u68C0\u6D4B\u4FE1\u53F7\u5230\u8FBE\u4F7F\u7528\u8005\u534F\u8C03\u5668\u7684\u9884\u671F\u65F6\u95F4\u3002 \n\u68C0\u6D4B\u4FE1\u53F7\u7528\u4E8E\u786E\u4FDD\u4F7F\u7528\u8005\u7684\u4F1A\u8BDD\u4FDD\u6301\u6FC0\u6D3B\u72B6\u6001\uFF0C\u5E76\u5728\u65B0\u4F7F\u7528\u8005\u52A0\u5165\u6216\u79BB\u5F00\u5206\u7EC4\u65F6\u4FC3\u8FDB\u518D\u5E73\u8861\u3002 \n\u8BE5\u503C\u5FC5\u987B\u4F4E\u4E8E session.timeout.ms\uFF0C\u4F46\u901A\u5E38\u4E0D\u5E94\u9AD8\u4E8E\u5B83\u7684 1/3\u3002 \n\u8BE5\u503C\u53EF\u8C03\u5F97\u66F4\u4F4E\uFF0C\u4EE5\u63A7\u5236\u6B63\u5E38\u518D\u5E73\u8861\u7684\u9884\u671F\u65F6\u95F4\u3002
MAX_PARTITION_FETCH_BYTES.NAME=\u6700\u5927\u6293\u53D6\u5206\u533A (\u5B57\u8282)
MAX_PARTITION_FETCH_BYTES.DESCRIPTION=\u670D\u52A1\u5668\u5C06\u8FD4\u56DE\u7684\u6BCF\u4E2A\u5206\u533A\u7684\u6700\u5927\u6570\u636E\u91CF\u3002\u7528\u4E8E\u8BF7\u6C42\u7684\u6700\u5927\u5185\u5B58\u603B\u91CF\u4E3A #partitions max.partition.fetch.bytes\u3002 \n\u6700\u5927\u6293\u53D6\u5206\u533A\u5FC5\u987B\u81F3\u5C11\u548C\u670D\u52A1\u5668\u5141\u8BB8\u7684\u6700\u5927\u6D88\u606F\u5927\u5C0F\u76F8\u540C\uFF0C\u5426\u5219\u751F\u6210\u5668\u53D1\u9001\u7684\u6D88\u606F\u5C31\u6709\u53EF\u80FD\u5927\u4E8E\u4F7F\u7528\u8005\u6240\u80FD\u6293\u53D6\u7684\u6D88\u606F\u3002 \n \u5982\u679C\u51FA\u73B0\u8FD9\u79CD\u60C5\u51B5\uFF0C\u4F7F\u7528\u8005\u5728\u6293\u53D6\u67D0\u4E2A\u5206\u533A\u4E0A\u7684\u5927\u578B\u6D88\u606F\u65F6\u5C31\u4F1A\u88AB\u5361\u4F4F\u3002
SESSION_TIMEOUT_MS.NAME=\u4F1A\u8BDD\u8D85\u65F6 (\u6BEB\u79D2)
SESSION_TIMEOUT_MS.DESCRIPTION=\u4F7F\u7528 Kafka \u7684\u5206\u7EC4\u7BA1\u7406\u8BBE\u65BD\u68C0\u6D4B\u6545\u969C\u65F6\u4F7F\u7528\u7684\u8D85\u65F6\u3002=\u4F1A\u8BDD\u8D85\u65F6 (\u6BEB\u79D2)
PARTITION_ASSIGNOR.NAME=\u5206\u533A\u5206\u914D\u8005
PARTITION_ASSIGNOR.DESCRIPTION=\u5206\u533A\u5206\u914D\u7B56\u7565\u7684\u7C7B\u540D\uFF0C\u5728\u4F7F\u7528\u5206\u7EC4\u7BA1\u7406\u65F6\uFF0C\u5BA2\u6237\u7AEF\u5C06\u4F7F\u7528\u8BE5\u7B56\u7565\u5728\u4F7F\u7528\u8005\u5B9E\u4F8B\u4E4B\u95F4\u5206\u914D\u5206\u533A\u6240\u6709\u6743\u3002
CONSUMER_REQUEST_TIMEOUT_MS.NAME=\u8BF7\u6C42\u8D85\u65F6 (\u6BEB\u79D2)
CONSUMER_REQUEST_TIMEOUT_MS.DESCRIPTION=\u8BE5\u914D\u7F6E\u53EF\u63A7\u5236\u5BA2\u6237\u7AEF\u7B49\u5F85\u8BF7\u6C42\u54CD\u5E94\u7684\u6700\u957F\u65F6\u95F4\u3002 \n\u5982\u679C\u5728\u8D85\u65F6\u524D\u672A\u6536\u5230\u54CD\u5E94\uFF0C\u5BA2\u6237\u7AEF\u5C06\u6839\u636E\u9700\u8981\u91CD\u65B0\u53D1\u9001\u8BF7\u6C42\uFF0C\u6216\u8005\u5728\u91CD\u8BD5\u6B21\u6570\u7528\u5C3D\u540E\u8BF7\u6C42\u5931\u8D25\u3002
BUFFER_MEMORY_SIZE.NAME=\u7F13\u51B2\u533A\u5185\u5B58\u5927\u5C0F
BUFFER_MEMORY_SIZE.DESCRIPTION=\u751F\u6210\u5668\u53EF\u7528\u4E8E\u7F13\u51B2\u7B49\u5F85\u53D1\u9001\u5230\u670D\u52A1\u5668\u7684\u8BB0\u5F55\u7684\u603B\u5185\u5B58\u5B57\u8282\u6570\u3002 \n\u5982\u679C\u53D1\u9001\u8BB0\u5F55\u7684\u901F\u5EA6\u8D85\u8FC7\u4E86\u670D\u52A1\u5668\u63A5\u6536\u8BB0\u5F55\u7684\u901F\u5EA6\uFF0C\u751F\u6210\u5668\u4F1A\u6839\u636E block.on.buffer.full \u6307\u5B9A\u7684\u4F18\u5148\u7EA7\u963B\u585E\u6216\u629B\u51FA\u5F02\u5E38\u3002 \n\u6B64\u8BBE\u7F6E\u5E94\u4E0E\u751F\u6210\u5668\u5C06\u4F7F\u7528\u7684\u5185\u5B58\u603B\u91CF\u5927\u81F4\u76F8\u7B26\uFF0C\u4F46\u5E76\u975E\u786C\u6027\u7EA6\u675F\uFF0C\u56E0\u4E3A\u751F\u6210\u5668\u4F7F\u7528\u7684\u5185\u5B58\u5E76\u975E\u5168\u90E8\u7528\u4E8E\u7F13\u51B2\u3002 \n\u4E00\u4E9B\u989D\u5916\u7684\u5185\u5B58\u5C06\u7528\u4E8E\u538B\u7F29 (\u5982\u679C\u542F\u7528\u4E86\u538B\u7F29\u529F\u80FD) \u4EE5\u53CA\u7EF4\u62A4\u8BF7\u6C42\u961F\u5217\u3002
RETRIES.NAME=\u91CD\u8BD5
RETRIES.DESCRIPTION=\u5982\u679C\u8BBE\u7F6E\u7684\u503C\u5927\u4E8E\u96F6\uFF0C\u5BA2\u6237\u7AEF\u5C06\u91CD\u65B0\u53D1\u9001\u53EF\u80FD\u56E0\u77AC\u65F6\u9519\u8BEF\u800C\u53D1\u9001\u5931\u8D25\u7684\u8BB0\u5F55\u3002 \n\u8BF7\u6CE8\u610F\uFF0C\u8FD9\u79CD\u91CD\u8BD5\u4E0E\u5BA2\u6237\u7AEF\u5728\u6536\u5230\u9519\u8BEF\u540E\u91CD\u65B0\u53D1\u9001\u8BB0\u5F55\u6CA1\u6709\u533A\u522B\u3002 \n\u5982\u679C\u5728\u6210\u529F\u786E\u8BA4\u524D\uFF0C\u8D85\u8FC7\u4E86 delivery.timeout.ms \u914D\u7F6E\u7684\u8D85\u65F6\u65F6\u95F4\uFF0C\u5219\u5728\u91CD\u8BD5\u6B21\u6570\u7528\u5B8C\u4E4B\u524D\uFF0C\u751F\u6210\u8BF7\u6C42\u5C06\u5931\u8D25\u3002\n \u4E00\u822C\u60C5\u51B5\u4E0B\uFF0C\u7528\u6237\u6700\u597D\u4E0D\u8BBE\u7F6E\u6B64\u914D\u7F6E\uFF0C\u800C\u662F\u4F7F\u7528 delivery.timeout.ms \u6765\u63A7\u5236\u91CD\u8BD5\u3002 \n\u542F\u7528 idempotence \u9700\u8981\u6B64\u914D\u7F6E\u503C\u5927\u4E8E 0\u3002 \u5982\u679C\u8BBE\u7F6E\u7684\u914D\u7F6E\u76F8\u4E92\u51B2\u7A81\uFF0C\u4E14\u672A\u660E\u786E\u542F\u7528 idempotence\uFF0C\u5219\u4F1A\u7981\u7528 idempotence\u3002 \n\u5982\u679C\u5C06 enable.idempotence \u8BBE\u7F6E\u4E3A false \u5E76\u5C06 max.in.flight.requests.per.connection \u8BBE\u7F6E\u4E3A 1 \u7684\u540C\u65F6\u5141\u8BB8\u91CD\u8BD5\uFF0C\u5219\u6709\u53EF\u80FD\u4F1A\u6539\u53D8\u8BB0\u5F55\u7684\u987A\u5E8F\uFF0C\u56E0\u4E3A\u5982\u679C\u5411\u4E00\u4E2A\u5206\u533A\u53D1\u9001\u4E24\u6279\u8BB0\u5F55\uFF0C \n\u7B2C\u4E00\u6279\u5931\u8D25\u540E\u91CD\u8BD5\uFF0C\u4F46\u7B2C\u4E8C\u6279\u6210\u529F\u53D1\u9001\uFF0C\u90A3\u4E48\u7B2C\u4E8C\u6279\u4E2D\u7684\u8BB0\u5F55\u53EF\u80FD\u4F1A\u5148\u51FA\u73B0\u3002
PRODUCER_BATCH_SIZE.NAME=\u6279\u5904\u7406\u5927\u5C0F
PRODUCER_BATCH_SIZE.DESCRIPTION=\u53EA\u8981\u6709\u591A\u4E2A\u8BB0\u5F55\u88AB\u53D1\u9001\u5230\u540C\u4E00\u4E2A\u5206\u533A\uFF0C\u751F\u6210\u5668\u5C31\u4F1A\u5C1D\u8BD5\u6309\u6279\u6B21\u53D1\u9001\uFF0C\u51CF\u5C11\u8BF7\u6C42\u6570\u91CF\u3002 \n\u8FD9\u6709\u52A9\u4E8E\u63D0\u9AD8\u5BA2\u6237\u7AEF\u548C\u670D\u52A1\u5668\u7684\u6027\u80FD\u3002\u6B64\u914D\u7F6E\u53EF\u63A7\u5236\u9ED8\u8BA4\u6279\u5904\u7406\u5927\u5C0F (\u4EE5\u5B57\u8282\u4E3A\u5355\u4F4D)\u3002 \n\u4E0D\u4F1A\u5C1D\u8BD5\u6279\u91CF\u53D1\u9001\u5927\u4E8E\u6B64\u5927\u5C0F\u7684\u8BB0\u5F55\u3002\u53D1\u9001\u7ED9\u4EE3\u7406\u7684\u8BF7\u6C42\u5C06\u5305\u542B\u591A\u4E2A\u6279\u6B21\uFF0C\u6BCF\u4E2A\u6709\u53EF\u53D1\u9001\u6570\u636E\u7684\u5206\u533A\u90FD\u6709\u4E00\u4E2A\u6279\u6B21\u3002 \n\u6279\u5904\u7406\u5927\u5C0F\u8F83\u5C0F\u65F6\uFF0C\u4F7F\u7528\u6279\u6B21\u53D1\u9001\u7684\u9891\u7387\u4F1A\u76F8\u5BF9\u8F83\u4F4E\uFF0C\u53EF\u80FD\u4F1A\u964D\u4F4E\u541E\u5410\u91CF (\u6279\u5904\u7406\u5927\u5C0F\u4E3A\u96F6\u5C06\u5B8C\u5168\u7981\u7528\u6279\u6B21\u53D1\u9001)\u3002 \n\u6279\u5904\u7406\u5927\u5C0F\u975E\u5E38\u5927\u65F6\uFF0C\u4F1A\u6BD4\u8F83\u6D6A\u8D39\u5185\u5B58\uFF0C\u56E0\u4E3A\u6211\u4EEC\u59CB\u7EC8\u9700\u8981\u5206\u914D\u4E00\u4E2A\u6307\u5B9A\u6279\u5904\u7406\u5927\u5C0F\u7684\u7F13\u51B2\u533A\uFF0C\u4EE5\u4FBF\u5904\u7406\u66F4\u591A\u8BB0\u5F55\u3002
CONNECTION_MAX_IDLE_MS.NAME=\u8FDE\u63A5\u6700\u5927\u7A7A\u95F2\u65F6\u95F4 (\u6BEB\u79D2)
CONNECTION_MAX_IDLE_MS.DESCRIPTION=\u8D85\u8FC7\u6B64\u914D\u7F6E\u6307\u5B9A\u7684\u6BEB\u79D2\u6570\u540E\u5173\u95ED\u7A7A\u95F2\u8FDE\u63A5\u3002
LINGER_MS.NAME=\u9017\u7559\u65F6\u95F4 (\u6BEB\u79D2)
LINGER_MS.DESCRIPTION=\u751F\u6210\u5668\u4F1A\u5C06\u5728\u8BF7\u6C42\u4F20\u8F93\u4E4B\u95F4\u5230\u8FBE\u7684\u8BB0\u5F55\u7EC4\u5408\u6210\u4E00\u4E2A\u5355\u4E00\u6279\u6B21\u7684\u8BF7\u6C42\u3002 \n\u901A\u5E38\u60C5\u51B5\u4E0B\uFF0C\u53EA\u6709\u5F53\u8BB0\u5F55\u5230\u8FBE\u7684\u901F\u5EA6\u5FEB\u4E8E\u53D1\u9001\u7684\u901F\u5EA6\u65F6\uFF0C\u624D\u4F1A\u51FA\u73B0\u8FD9\u79CD\u60C5\u51B5\u3002\u4E0D\u8FC7\uFF0C\u5728\u67D0\u4E9B\u60C5\u51B5\u4E0B\uFF0C\u5BA2\u6237\u7AEF\u53EF\u80FD\u5E0C\u671B\u51CF\u5C11\u8BF7\u6C42\u6570\u91CF\uFF0C\u5373\u4F7F\u662F\u5728\u4E2D\u7B49\u8D1F\u8377\u7684\u60C5\u51B5\u4E0B\u3002 \n\u8FD9\u79CD\u8BBE\u7F6E\u901A\u8FC7\u5C11\u91CF\u589E\u52A0\u4EBA\u4E3A\u5EF6\u8FDF\u5B9E\u73B0\uFF0C\u4E5F\u5C31\u662F\u8BF4\uFF0C\u751F\u6210\u5668\u4E0D\u4F1A\u7ACB\u5373\u53D1\u9001\u8BB0\u5F55\uFF0C\u800C\u662F\u4F1A\u5728\u8BBE\u5B9A\u7684\u5EF6\u8FDF\u65F6\u95F4\u5185\u7B49\u5F85\u5176\u4ED6\u8BB0\u5F55\uFF0C\u8FD9\u6837\u5C31\u53EF\u4EE5\u96C6\u4E2D\u53D1\u9001\u8BB0\u5F55\u3002 \n\u8FD9\u7C7B\u4F3C\u4E8E TCP \u4E2D\u7684\u7EB3\u683C\u7B97\u6CD5\u3002\u8FD9\u79CD\u8BBE\u7F6E\u8BBE\u5B9A\u4E86\u6279\u5904\u7406\u5EF6\u8FDF\u7684\u4E0A\u9650\uFF1A \n\u4E00\u65E6\u6279\u5904\u7406\u5927\u5C0F\u8FBE\u5230\u5411\u4E00\u4E2A\u5206\u533A\u53D1\u9001\u7684\u8BB0\u5F55\u6570\u91CF\uFF0C\u65E0\u8BBA\u8FD9\u4E2A\u8BBE\u7F6E\u5982\u4F55\uFF0C\u5C06\u7ACB\u5373\u53D1\u9001\u8BB0\u5F55\uFF0C\u4F46\u5982\u679C\u6279\u5904\u7406\u5927\u5C0F\u5C0F\u4E8E\u5206\u533A\u7684\u7D2F\u79EF\u5B57\u8282\u6570\uFF0C\u5C06\u5728\u6307\u5B9A\u7684\u65F6\u95F4\u5185\u201C\u9017\u7559\u201D\uFF0C\u7B49\u5F85\u66F4\u591A\u7684\u8BB0\u5F55\u51FA\u73B0\u3002 \n\u6B64\u8BBE\u7F6E\u7684\u9ED8\u8BA4\u503C\u4E3A 0 (\u5373\u65E0\u5EF6\u8FDF)\u3002\u5982\u679C\u8BBE\u7F6E linger.ms=5\uFF0C\u5C31\u4F1A\u51CF\u5C11\u53D1\u9001\u8BF7\u6C42\u7684\u6570\u91CF\uFF0C\u4F46\u5728\u6CA1\u6709\u8D1F\u8F7D\u7684\u60C5\u51B5\u4E0B\uFF0C\u53D1\u9001\u8BB0\u5F55\u7684\u5EF6\u8FDF\u65F6\u95F4\u6700\u591A\u589E\u52A0 5 \u6BEB\u79D2\u3002
MAX_BLOCK_MS.NAME=\u6700\u957F\u963B\u585E\u65F6\u95F4 (\u6BEB\u79D2)
MAX_BLOCK_MS.DESCRIPTION=\u6B64\u914D\u7F6E\u63A7\u5236 KafkaProducer \u7684 send()\u3001partitionsFor()\u3001initTransactions()\u3001sendOffsetsToTransaction()\u3001commitTransaction() \u548C abortTransaction() \u65B9\u6CD5\u7684\u963B\u585E\u65F6\u95F4\u3002 \n\u5BF9\u4E8E send()\uFF0C\u8BE5\u8D85\u65F6\u9650\u5236\u4E86\u5143\u6570\u636E\u6293\u53D6\u548C\u7F13\u51B2\u533A\u5206\u914D\u7684\u603B\u7B49\u5F85\u65F6\u95F4 (\u7528\u6237\u63D0\u4F9B\u7684\u5E8F\u5217\u5316\u7A0B\u5E8F\u6216\u5206\u533A\u5668\u4E2D\u7684\u963B\u585E\u4E0D\u8BA1\u5165\u8BE5\u8D85\u65F6)\u3002 \n\u5BF9\u4E8E partitionsFor()\uFF0C\u5982\u679C\u5143\u6570\u636E\u4E0D\u53EF\u7528\uFF0C\u8BE5\u8D85\u65F6\u4F1A\u9650\u5236\u7B49\u5F85\u5143\u6570\u636E\u7684\u65F6\u95F4\u3002 \n\u4E0E\u4E8B\u52A1\u76F8\u5173\u7684\u65B9\u6CD5\u59CB\u7EC8\u963B\u585E\uFF0C\u4F46\u5982\u679C\u65E0\u6CD5\u53D1\u73B0\u4E8B\u52A1\u534F\u8C03\u5668\u6216\u5728\u8D85\u65F6\u65F6\u95F4\u5185\u6CA1\u6709\u54CD\u5E94\uFF0C\u5219\u53EF\u80FD\u4F1A\u8D85\u65F6\u3002
MAX_REQUEST_SIZE.NAME=\u6700\u5927\u8BF7\u6C42\u5927\u5C0F
MAX_REQUEST_SIZE.DESCRIPTION=\u8BF7\u6C42\u7684\u6700\u5927\u5927\u5C0F\u3002\u8FD9\u5B9E\u9645\u4E0A\u4E5F\u662F\u6700\u5927\u8BB0\u5F55\u5927\u5C0F\u7684\u4E0A\u9650\u3002 \n\u8BF7\u6CE8\u610F\uFF0C\u670D\u52A1\u5668\u6709\u81EA\u5DF1\u7684\u8BB0\u5F55\u5927\u5C0F\u4E0A\u9650\uFF0C\u53EF\u80FD\u4E0E\u6B64\u4E0D\u540C\u3002 \n\u6B64\u8BBE\u7F6E\u5C06\u9650\u5236\u751F\u6210\u5668\u5728\u5355\u6B21\u8BF7\u6C42\u4E2D\u53D1\u9001\u8BB0\u5F55\u6279\u6B21\u7684\u6570\u91CF\uFF0C\u907F\u514D\u53D1\u9001\u5927\u91CF\u8BF7\u6C42\u3002
RECEIVE_BUFFER_BYTES.NAME=\u63A5\u6536\u7F13\u51B2\u533A (\u5B57\u8282)
RECEIVE_BUFFER_BYTES.DESCRIPTION=\u8BFB\u53D6\u6570\u636E\u65F6\u4F7F\u7528\u7684 TCP \u63A5\u6536\u7F13\u51B2\u533A (SO_RCVBUF) \u7684\u5927\u5C0F\u3002
MAX_IN_FLIGHT_REQUEST.NAME=\u6700\u5927\u8FDB\u884C\u4E2D\u8BF7\u6C42\u6570
MAX_IN_FLIGHT_REQUEST.DESCRIPTION=\u5BA2\u6237\u7AEF\u5728\u963B\u585E\u524D\u5728\u5355\u4E2A\u8FDE\u63A5\u4E0A\u53D1\u9001\u7684\u672A\u786E\u8BA4\u8BF7\u6C42\u7684\u6700\u5927\u6570\u91CF\u3002 \n\u8BF7\u6CE8\u610F\uFF0C\u5982\u679C\u8BE5\u8BBE\u7F6E\u5927\u4E8E 1 \u4E14\u53D1\u9001\u5931\u8D25\uFF0C\u5219\u6709\u53EF\u80FD\u56E0\u91CD\u8BD5\u800C\u5BFC\u81F4\u6D88\u606F\u91CD\u65B0\u6392\u5E8F (\u5373\u542F\u7528\u91CD\u8BD5\u7684\u60C5\u51B5\u4E0B)\u3002
METADATA_MAX_AGE_MS.NAME=\u5143\u6570\u636E\u6700\u957F\u8FC7\u671F\u65F6\u95F4 (\u6BEB\u79D2)
METADATA_MAX_AGE_MS.DESCRIPTION=\u4EE5\u6BEB\u79D2\u4E3A\u5355\u4F4D\u7684\u65F6\u95F4\u6BB5\u3002\u5728\u8BE5\u65F6\u95F4\u6BB5\u540E\uFF0C\u5373\u4F7F\u6CA1\u6709\u4EFB\u4F55\u5206\u533A\u9886\u5BFC\u8005\u7684\u53D8\u5316\uFF0C\u4E5F\u4F1A\u5F3A\u5236\u5237\u65B0\u5143\u6570\u636E\uFF0C\u4E3B\u52A8\u53D1\u73B0\u65B0\u7684\u4EE3\u7406\u6216\u5206\u533A\u3002
RECONNECT_BACKOFF_MS.NAME=\u91CD\u65B0\u8FDE\u63A5\u56DE\u9000 (\u6BEB\u79D2)
RECONNECT_BACKOFF_MS.DESCRIPTION=\u5C1D\u8BD5\u91CD\u65B0\u8FDE\u63A5\u6307\u5B9A\u4E3B\u673A\u524D\u7684\u7B49\u5F85\u65F6\u95F4\u3002\u8FD9\u53EF\u4EE5\u907F\u514D\u5728\u7D27\u5F20\u7684\u5FAA\u73AF\u4E2D\u91CD\u590D\u8FDE\u63A5\u4E3B\u673A\u3002 \n\u6B64\u56DE\u9000\u9002\u7528\u4E8E\u4F7F\u7528\u8005\u5411\u4EE3\u7406\u53D1\u9001\u7684\u6240\u6709\u8BF7\u6C42\u3002
URI_OPTIONS.DESCRIPTION=Kafka \u5C5E\u6027
USE_SCHEMA_REGISTRY.NAME=\u4F7F\u7528\u67B6\u6784\u6CE8\u518C\u8868
SCHEMA_REGISTRY_URL.NAME=\u67B6\u6784\u6CE8\u518C\u8868 URL
SCHEMA_REGISTRY_URL.DESCRIPTION=\u8981\u4F7F\u7528\u7684 Confluent Platform \u67B6\u6784\u6CE8\u518C\u8868\u670D\u52A1\u5668\u7684 URL\u3002\u683C\u5F0F\u4E3A\u4E3B\u673A 1\uFF1A\u7AEF\u53E3 1\uFF0C\u4E3B\u673A 2 \uFF1A\u7AEF\u53E3 2\u3002 \n\u8FD9\u5728 Confluent Platform \u6587\u6863\u4E2D\u79F0\u4E3A schema.registry.url\u3002 \n\u8BE5\u9009\u9879\u4EC5\u9002\u7528\u4E8E Confluent Platform (\u975E\u6807\u51C6 Apache Kafka)\u3002
