LONG_NAME=Kafka\u306E\u30B8\u30A7\u30CD\u30EA\u30C3\u30AF\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8
HELP=org.talend.esb.help.cKafka
BROKER_LIST.NAME=\u30D6\u30ED\u30FC\u30AB\u30FC\u30EA\u30B9\u30C8
BROKER_LIST.DESCRIPTION=\u4F7F\u7528\u3059\u308BKafka\u30D6\u30ED\u30FC\u30AB\u30FC\u306E URL\u3002\u5F62\u5F0F\u306Fhost1:port1,host2:port2\u3067\u3001\u30EA\u30B9\u30C8\u306F\u30D6\u30ED\u30FC\u30AB\u30FC\u306E\u30B5\u30D6\u30BB\u30C3\u30C8\u307E\u305F\u306F\u30D6\u30ED\u30FC\u30AB\u30FC\u306E\u30B5\u30D6\u30BB\u30C3\u30C8\u3092\u30DD\u30A4\u30F3\u30C8\u3059\u308BVIP\u306B\u306A\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\n \u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u3001Kafka\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C6\u30FC\u30B7\u30E7\u30F3\u3067\u306Fbootstrap.servers\u3068\u547C\u3070\u308C\u3066\u3044\u307E\u3059\u3002
CLIENT_ID.NAME=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID
CLIENT_ID.DESCRIPTION=\u30B3\u30FC\u30EB\u306E\u8FFD\u8DE1\u3092\u52A9\u3051\u308B\u305F\u3081\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID\u306F\u5404\u30EA\u30AF\u30A8\u30B9\u30C8\u3067\u9001\u3089\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u6307\u5B9A\u306E\u6587\u5B57\u5217\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002 \n\u3053\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8ID\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u884C\u3046\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u8AD6\u7406\u7684\u306B\u8B58\u5225\u3059\u308B\u3082\u306E\u3067\u3042\u308B\u3053\u3068\u304C\u5FC5\u8981\u3067\u3059\u3002
TOPIC.NAME=\u30C8\u30D4\u30C3\u30AF
TOPIC.DESCRIPTION=\u30C8\u30D4\u30C3\u30AF\u306E\u540D\u524D
GROUP_ID.NAME=\u30B0\u30EB\u30FC\u30D7ID
GROUP_ID.DESCRIPTION=\u3053\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u5C5E\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30D7\u30ED\u30BB\u30B9\u306E\u30B0\u30EB\u30FC\u30D7\u3092\u4E00\u610F\u8B58\u5225\u3059\u308B\u305F\u3081\u306E\u6587\u5B57\u5217\u3002 \n\u540C\u3058\u30B0\u30EB\u30FC\u30D7ID\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u3001\u8907\u6570\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u3069\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3082\u540C\u3058\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u5C5E\u3057\u3066\u3044\u308B\u3053\u3068\u304C\u793A\u3055\u308C\u307E\u3059\u3002
PARTITIONER.NAME=\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30CA\u30FC
PARTITIONER.DESCRIPTION=\u30B5\u30D6\u30C8\u30D4\u30C3\u30AF\u9593\u3067\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5206\u5272\u3059\u308B\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30CA\u30FC\u30AF\u30E9\u30B9\u3002 \n\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30CA\u30FC\u306F\u30AD\u30FC\u306E\u30CF\u30C3\u30B7\u30E5\u306B\u57FA\u3065\u3044\u3066\u3044\u307E\u3059\u3002
URI_OPTIONS.NAME=Kafka\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
URI_OPTIONS.ITEM.NAME=\u540D\u524D
URI_OPTIONS.ITEM.VALUE=\u5024
COMPRESSION_CODEC.NAME=\u5727\u7E2E\u5F62\u5F0F
COMPRESSION_CODEC.DESCRIPTION=\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3067\u306F\u3001\u3053\u306E\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306B\u3088\u3063\u3066\u751F\u6210\u3055\u308C\u305F\u5168\u30C7\u30FC\u30BF\u306E\u5727\u7E2E\u30B3\u30FC\u30C7\u30C3\u30AF\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002 \n\u6709\u52B9\u306A\u5024\u306F\u3001none\u3001gzip\u3001snappy\u3001lz4\u3001zstd\u3067\u3059\u3002
COMPRESSION_CODEC.ITEM.NONE=\u306A\u3057
COMPRESSION_CODEC.ITEM.GZIP=GZIP
COMPRESSION_CODEC.ITEM.SNAPPY=SNAPPY
COMPRESSION_CODEC.ITEM.LZ4=LZ4
REQUEST_REQUIRED_ACKS.NAME=\u5FC5\u8981\u306A\u627F\u8A8D\u3092\u30EA\u30AF\u30A8\u30B9\u30C8
REQUEST_REQUIRED_ACKS.DESCRIPTION=\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u5B8C\u4E86\u3057\u305F\u3068\u898B\u306A\u3059\u307E\u3067\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C\u30EA\u30FC\u30C0\u30FC\u306B\u53D7\u3051\u53D6\u308B\u3088\u3046\u8981\u6C42\u3059\u308B\u78BA\u8A8D\u5FDC\u7B54\u306E\u6570\u3002 \n\u3053\u308C\u306F\u9001\u4FE1\u3055\u308C\u308B\u8A18\u9332\u306E\u8010\u4E45\u6027\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002 \n\u53EF\u80FD\u306A\u8A2D\u5B9A\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059: acks=0 \u30BC\u30ED\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u306F\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u306E\u5FDC\u7B54\u3092\u5F85\u3061\u307E\u305B\u3093\u3002 \n\u30EC\u30B3\u30FC\u30C9\u306F\u5373\u5EA7\u306B\u30BD\u30B1\u30C3\u30C8\u30D0\u30C3\u30D5\u30A1\u30FC\u306B\u8FFD\u52A0\u3055\u308C\u3001\u9001\u4FE1\u3055\u308C\u305F\u3082\u306E\u3068\u898B\u306A\u3055\u308C\u307E\u3059\u3002 \n\u3053\u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u30EC\u30B3\u30FC\u30C9\u3092\u53D7\u4FE1\u3057\u305F\u3053\u3068\u306F\u4FDD\u8A3C\u3067\u304D\u305A\u3001(\u901A\u5E38\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u5931\u6557\u3092\u77E5\u308B\u3053\u3068\u304C\u3067\u304D\u306A\u3044\u305F\u3081)\u518D\u8A66\u884C\u8A2D\u5B9A\u306F\u6709\u52B9\u306B\u306A\u308A\u307E\u305B\u3093\u3002\n \u5404\u30EC\u30B3\u30FC\u30C9\u306B\u8FD4\u3055\u308C\u308B\u30AA\u30D5\u30BB\u30C3\u30C8\u306F\u5E38\u306B-1\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002 \nacks=1 \u3053\u308C\u306F\u3001\u30EA\u30FC\u30C0\u30FC\u304C\u305D\u306E\u30ED\u30FC\u30AB\u30EB\u30ED\u30B0\u306B\u8A18\u9332\u3092\u66F8\u304D\u8FBC\u3080\u3082\u306E\u306E\u3001\u3059\u3079\u3066\u306E\u30D5\u30A9\u30ED\u30EF\u30FC\u304B\u3089\u306E\u5B8C\u5168\u306A\u627F\u8A8D\u3092\u5F85\u305F\u305A\u306B\u5FDC\u7B54\u3059\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002 \n\u3053\u306E\u30B1\u30FC\u30B9\u3067\u306F\u3001\u30EA\u30FC\u30C0\u30FC\u304C\u30EC\u30B3\u30FC\u30C9\u3092\u627F\u8A8D\u3057\u305F\u76F4\u5F8C\u3067\u3001\u304B\u3064\u30D5\u30A9\u30ED\u30EF\u30FC\u304C\u305D\u306E\u30EC\u30B3\u30FC\u30C9\u3092\u8907\u88FD\u3059\u308B\u524D\u306B\u30EA\u30FC\u30C0\u30FC\u304C\u5931\u6557\u3059\u308B\u3068\u3001\u305D\u306E\u30EC\u30B3\u30FC\u30C9\u306F\u5931\u308F\u308C\u307E\u3059\u3002 \nacks=all \u3053\u306E\u5834\u5408\u3001\u30EA\u30FC\u30C0\u30FC\u306F\u540C\u671F\u3057\u3066\u3044\u308B\u30EC\u30D7\u30EA\u30AB\u306E\u30D5\u30EB\u30BB\u30C3\u30C8\u304C\u30EC\u30B3\u30FC\u30C9\u3092\u627F\u8A8D\u3059\u308B\u306E\u3092\u5F85\u3064\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002 \n\u3053\u308C\u306B\u3088\u308A\u3001\u540C\u671F\u30EC\u30D7\u30EA\u30AB\u304C\u5C11\u306A\u304F\u3068\u30821\u3064\u751F\u304D\u3066\u3044\u308B\u9650\u308A\u30EC\u30B3\u30FC\u30C9\u304C\u5931\u308F\u308C\u306A\u3044\u3053\u3068\u304C\u4FDD\u8A3C\u3055\u308C\u307E\u3059\u3002 \n\u3053\u308C\u306F\u5229\u7528\u53EF\u80FD\u306A\u6700\u5F37\u306E\u4FDD\u8A3C\u3067\u3001acks=-1\u3068\u540C\u3058\u8A2D\u5B9A\u306B\u306A\u308A\u307E\u3059\u3002 \nidempotence\u3092\u6709\u52B9\u306B\u3059\u308B\u305F\u3081\u306B\u306F\u3001\u3053\u306E\u8A2D\u5B9A\u5024\u3092[all]\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u8A2D\u5B9A\u304C\u7AF6\u5408\u3057\u3001idempotence\u304C\u660E\u793A\u7684\u306B\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u306A\u3044\u5834\u5408\u3001idempotence\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002
REQUEST_REQUIRED_ACKS.ITEM.MINUS_ONE=-1
REQUEST_REQUIRED_ACKS.ITEM.ZERO=0
REQUEST_REQUIRED_ACKS.ITEM.ONE=1
REQUEST_REQUIRED_ACKS.ITEM.ALL=\u3059\u3079\u3066
RETRY_BACKOFF_MS.NAME=\u518D\u8A66\u884C\u30D0\u30C3\u30AF\u30AA\u30D5(\u30DF\u30EA\u79D2)
RETRY_BACKOFF_MS.DESCRIPTION=\u5404\u518D\u8A66\u884C\u306E\u524D\u306B\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306F\u95A2\u9023\u3059\u308B\u30C8\u30D4\u30C3\u30AF\u306E\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u66F4\u65B0\u3057\u3001\u65B0\u3057\u3044\u30EA\u30FC\u30C0\u30FC\u304C\u9078\u51FA\u3055\u308C\u305F\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002 \n\u30EA\u30FC\u30C0\u30FC\u306E\u9078\u51FA\u306B\u306F\u5C11\u3057\u6642\u9593\u304C\u304B\u304B\u308B\u305F\u3081\u3001\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u66F4\u65B0\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
SEND_BUFFER_BYTES.NAME=\u9001\u4FE1\u30D0\u30C3\u30D5\u30A1\u30FC(\u30D0\u30A4\u30C8)
SEND_BUFFER_BYTES.DESCRIPTION=\u30BD\u30B1\u30C3\u30C8\u306E\u66F8\u304D\u8FBC\u307F\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA\u3002
REQUEST_TIMEOUT_MS.NAME=\u30EA\u30AF\u30A8\u30B9\u30C8\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8(\u30DF\u30EA\u79D2)
REQUEST_TIMEOUT_MS.DESCRIPTION=\u30D6\u30ED\u30FC\u30AB\u30FC\u304C\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30A8\u30E9\u30FC\u3092\u9001\u308A\u8FD4\u3059\u524D\u306B\u3001request.required.acks\u306E\u8981\u6C42\u3092\u6E80\u305F\u3059\u305F\u3081\u306E\u5F85\u6A5F\u6642\u9593\u3002
SERIALIZER_CLASS.NAME=\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u30FC\u30AF\u30E9\u30B9
SERIALIZER_CLASS.DESCRIPTION=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u30FC\u30AF\u30E9\u30B9\u3002
KEY_SERIALIZER_CLASS.NAME=\u30AD\u30FC\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u30FC\u30AF\u30E9\u30B9
KEY_SERIALIZER_CLASS.DESCRIPTION=\u30AD\u30FC\u306E\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u30FC\u30AF\u30E9\u30B9(\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u4F55\u3082\u4E0E\u3048\u3089\u308C\u306A\u3051\u308C\u3070\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u5834\u5408\u3068\u540C\u3058)\u3002
AUTO_COMMIT_ENABLE.NAME=\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u6709\u52B9\u5316
AUTO_COMMIT_ENABLE.DESCRIPTION=True\u306E\u5834\u5408\u306F\u3001\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u65E2\u306B\u53D6\u5F97\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30AA\u30D5\u30BB\u30C3\u30C8\u3092\u5B9A\u671F\u7684\u306BZooKeeper\u306B\u30B3\u30DF\u30C3\u30C8\u3057\u307E\u3059\u3002 \n\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30AA\u30D5\u30BB\u30C3\u30C8\u306F\u3001\u51E6\u7406\u306E\u5931\u6557\u6642\u306B\u65B0\u3057\u3044\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u958B\u59CB\u3059\u308B\u4F4D\u7F6E\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
AUTO_COMMIT_INTERVAL_MS.NAME=\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u9593\u9694(\u30DF\u30EA\u79D2)
AUTO_COMMIT_INTERVAL_MS.DESCRIPTION=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30AA\u30D5\u30BB\u30C3\u30C8\u304CZookeeper\u306B\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u308B\u983B\u5EA6\u3002
FETCH_MIN_BYTES.NAME=\u30D5\u30A7\u30C3\u30C1\u6700\u5C0F(\u30D0\u30A4\u30C8)
FETCH_MIN_BYTES.DESCRIPTION=\u30D5\u30A7\u30C3\u30C1\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5BFE\u3057\u3066\u30B5\u30FC\u30D0\u30FC\u304C\u8FD4\u3059\u3079\u304D\u6700\u5C0F\u30C7\u30FC\u30BF\u91CF\u3002 \n\u5229\u7528\u3067\u304D\u308B\u30C7\u30FC\u30BF\u304C\u4E0D\u5341\u5206\u306A\u5834\u5408\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u305D\u306E\u30C7\u30FC\u30BF\u304C\u84C4\u7A4D\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u3066\u304B\u3089\u5FDC\u7B54\u3057\u307E\u3059\u3002
FETCH_WAIT_MAX_MS.NAME=\u30D5\u30A7\u30C3\u30C1\u5F85\u6A5F\u6700\u5927(\u30DF\u30EA\u79D2)
FETCH_WAIT_MAX_MS.DESCRIPTION=fetch.min.bytes\u3092\u3059\u3050\u306B\u6E80\u305F\u3059\u3060\u3051\u306E\u5341\u5206\u306A\u30C7\u30FC\u30BF\u304C\u306A\u3044\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u30D5\u30A7\u30C3\u30C1\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5FDC\u7B54\u3059\u308B\u524D\u306B\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u6700\u5927\u6642\u9593\u3002
AUTO_OFFSET_RESET.NAME=\u81EA\u52D5\u30AA\u30D5\u30BB\u30C3\u30C8\u30EA\u30BB\u30C3\u30C8
AUTO_OFFSET_RESET.DESCRIPTION=ZooKeeper\u306B\u521D\u671F\u30AA\u30D5\u30BB\u30C3\u30C8\u304C\u306A\u3044\u5834\u5408\u3001\u307E\u305F\u306F\u30AA\u30D5\u30BB\u30C3\u30C8\u304C\u7BC4\u56F2\u5916\u306E\u5834\u5408\u306E\u51E6\u7406: \nearliest: \u30AA\u30D5\u30BB\u30C3\u30C8\u3092\u6700\u3082\u65E9\u3044\u30AA\u30D5\u30BB\u30C3\u30C8\u306B\u81EA\u52D5\u7684\u306B\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002 \nlatest : \u30AA\u30D5\u30BB\u30C3\u30C8\u3092\u6700\u3082\u9045\u3044\u30AA\u30D5\u30BB\u30C3\u30C8\u306B\u81EA\u52D5\u7684\u306B\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002 \nfail: \u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u4F8B\u5916\u3092\u8FD4\u3057\u307E\u3059\u3002
AUTO_OFFSET_RESET.ITEM.LATEST=\u6700\u65B0
AUTO_OFFSET_RESET.ITEM.EARLIEST=\u6700\u3082\u65E9\u3044
AUTO_OFFSET_RESET.ITEM.NONE=\u306A\u3057
SSL.NAME=SSL
SSL_KEY_PASSWORD.NAME=SSL\u30AD\u30FC\u30D1\u30B9\u30EF\u30FC\u30C9
SSL_KEY_PASSWORD.DESCRIPTION=\u30AD\u30FC\u30B9\u30C8\u30A2\u30D5\u30A1\u30A4\u30EB\u306E\u30B7\u30FC\u30AF\u30EC\u30C3\u30C8\u30AD\u30FC\u3001\u307E\u305F\u306FsslKeystoreKey\u3067\u6307\u5B9A\u3055\u308C\u3066\u3044\u308BPEM\u30AD\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002 \n\u3053\u308C\u306F\u3001\u53CC\u65B9\u5411\u8A8D\u8A3C\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u8981\u6C42\u3055\u308C\u307E\u3059\u3002
SSL_KEYSTORE_LOCATION.NAME=SSL\u30AD\u30FC\u30B9\u30C8\u30A2\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3
SSL_KEYSTORE_LOCATION.DESCRIPTION=\u30AD\u30FC\u30B9\u30C8\u30A2\u30D5\u30A1\u30A4\u30EB\u306E\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3\u3002\u3053\u308C\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u3042\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u53CC\u65B9\u5411\u8A8D\u8A3C\u306B\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
SSL_KEYSTORE_PASSWORD.NAME=SSL\u30AD\u30FC\u30B9\u30C8\u30A2\u30D1\u30B9\u30EF\u30FC\u30C9
SSL_KEYSTORE_PASSWORD.DESCRIPTION=\u30AD\u30FC\u30B9\u30C8\u30A2\u30D5\u30A1\u30A4\u30EB\u306E\u30B9\u30C8\u30A2\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u3053\u308C\u306F\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u3001sslKeystoreLocation\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u5FC5\u8981\u3067\u3059\u3002 \n\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u306FPEM\u5F62\u5F0F\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
SSL_TRUSTSTORE_LOCATION.NAME=SSL\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3
SSL_TRUSTSTORE_LOCATION.DESCRIPTION=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u30D5\u30A1\u30A4\u30EB\u306E\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3\u3002
SSL_TRUSTSTORE_PASSWORD.NAME=SSL\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u30D1\u30B9\u30EF\u30FC\u30C9
SSL_TRUSTSTORE_PASSWORD.DESCRIPTION=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u30D5\u30A1\u30A4\u30EB\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u304C\u3001\u5B8C\u5168\u6027\u30C1\u30A7\u30C3\u30AF\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002 \n\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u306FPEM\u5F62\u5F0F\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
SSL_CIPHER_SUITS.NAME=SSL\u6697\u53F7\u30B9\u30A4\u30FC\u30C8
SSL_CIPHER_SUITS.DESCRIPTION=\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u306E\u30EA\u30B9\u30C8\u3002\u3053\u308C\u306F\u3001TLS\u3084SSL\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30D7\u30ED\u30C8\u30B3\u30EB\u3092\u4F7F\u3063\u305F\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u63A5\u7D9A\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u306E\u30CD\u30B4\u30B7\u30A8\u30FC\u30B7\u30E7\u30F3\u306B\u4F7F\u308F\u308C\u308B \n\u8A8D\u8A3C\u3001\u6697\u53F7\u5316\u3001MAC\u3001\u9375\u4EA4\u63DB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306E\u7D44\u307F\u5408\u308F\u305B\u306E\u540D\u524D\u3067\u3059\u3002 \n\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u5229\u7528\u53EF\u80FD\u306A\u3059\u3079\u3066\u306E\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u3059\u3002
SSL_ENDPOINT_ALGORITHM.NAME=SSL\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
SSL_ENDPOINT_ALGORITHM.DESCRIPTION=\u30B5\u30FC\u30D0\u30FC\u8A3C\u660E\u66F8\u3092\u4F7F\u3063\u3066\u30B5\u30FC\u30D0\u30FC\u30DB\u30B9\u30C8\u540D\u3092\u691C\u8A3C\u3059\u308B\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u8B58\u5225\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002 \n\u30B5\u30FC\u30D0\u30FC\u306E\u30DB\u30B9\u30C8\u540D\u691C\u8A3C\u3092\u7121\u52B9\u306B\u3059\u308B\u5834\u5408\u306F\u3001none\u307E\u305F\u306Ffalse\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
SASL.NAME=SASL
SASL_KERBEROS_SERVICE_NAME.NAME=Kerberos\u30B5\u30FC\u30D3\u30B9\u540D
SASL_KERBEROS_SERVICE_NAME.DESCRIPTION=Kafka\u304C\u5B9F\u884C\u3059\u308BKerberos\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u540D\u3002\u3053\u308C\u306FKafka\u306EJAAS\u8A2D\u5B9A\u304BKafka\u306E\u8A2D\u5B9A\u3067\u5B9A\u7FA9\u3067\u304D\u307E\u3059\u3002
SECURITY_PROTOCOL.NAME=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30D7\u30ED\u30C8\u30B3\u30EB
SECURITY_PROTOCOL.DESCRIPTION=\u30D6\u30ED\u30FC\u30AB\u30FC\u3068\u306E\u901A\u4FE1\u306B\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3002SASL_PLAINTEXT\u3001PLAINTEXT\u3001SASL_SSL\u3001SSL\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u3059\u3002
SECURITY_PROTOCOL.ITEM.PLAINTEXT=Plaintext
SECURITY_PROTOCOL.ITEM.SSL=SSL
SECURITY_PROTOCOL.ITEM.SASL_PLAINTEXT=SASL over Plaintext
SECURITY_PROTOCOL.ITEM.SASL_SSL=SASL over SSL
HEARTBEAT_INTERVAL_MS.NAME=\u30CF\u30FC\u30C8\u30D3\u30FC\u30C8\u9593\u9694(\u30DF\u30EA\u79D2)
HEARTBEAT_INTERVAL_MS.DESCRIPTION=Kafka\u306E\u30B0\u30EB\u30FC\u30D7\u7BA1\u7406\u6A5F\u80FD\u306E\u4F7F\u7528\u306B\u304A\u3051\u308B\u3001\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30B3\u30FC\u30C7\u30A3\u30CD\u30FC\u30BF\u30FC\u306E\u30CF\u30FC\u30C8\u30D3\u30FC\u30C8\u9593\u306E\u4E88\u60F3\u6642\u9593\u3002 \n\u30CF\u30FC\u30C8\u30D3\u30FC\u30C8\u306F\u3001\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u307E\u307E\u3067\u3042\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3001\u65B0\u3057\u3044\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30B0\u30EB\u30FC\u30D7\u306B\u53C2\u52A0\u307E\u305F\u306F\u8131\u9000\u3059\u308B\u6642\u306B\u518D\u8ABF\u6574\u304C\u5BB9\u6613\u306B\u306A\u308B\u3088\u3046\u306B\u4F7F\u308F\u308C\u307E\u3059\u3002 \n\u3053\u306E\u5024\u306Fsession.timeout.ms\u3088\u308A\u3082\u4F4E\u304F\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u304C\u3001\u901A\u5E38\u306F\u305D\u306E\u5024\u306E1/3\u4EE5\u4E0B\u306E\u8A2D\u5B9A\u304C\u671B\u307E\u308C\u307E\u3059\u3002 \n\u901A\u5E38\u306E\u518D\u8ABF\u6574\u306E\u4E88\u60F3\u6642\u9593\u3092\u5236\u5FA1\u3059\u308B\u305F\u3081\u306B\u3001\u3055\u3089\u306B\u4F4E\u304F\u8ABF\u6574\u3057\u3066\u3082\u69CB\u3044\u307E\u305B\u3093\u3002
MAX_PARTITION_FETCH_BYTES.NAME=\u6700\u5927\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u30D5\u30A7\u30C3\u30C1(\u30D0\u30A4\u30C8)
MAX_PARTITION_FETCH_BYTES.DESCRIPTION=\u30B5\u30FC\u30D0\u30FC\u304C\u8FD4\u3059\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u3054\u3068\u306E\u6700\u5927\u30C7\u30FC\u30BF\u91CF\u3002\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u4F7F\u308F\u308C\u308B\u6700\u5927\u5408\u8A08\u30E1\u30E2\u30EA\u91CF\u306F\u3001#partitions max.partition.fetch.bytes\u306B\u306A\u308A\u307E\u3059\u3002 \n\u3053\u306E\u30B5\u30A4\u30BA\u306F\u3001\u5C11\u306A\u304F\u3068\u3082\u30B5\u30FC\u30D0\u30FC\u304C\u8A31\u53EF\u3059\u308B\u6700\u5927\u30E1\u30C3\u30BB\u30FC \u30B8\u30B5\u30A4\u30BA\u3068\u540C\u3058\u5927\u304D\u3055\u3067\u3042\u308B\u3053\u3068\u304C\u5FC5\u8981\u3067\u3059\u3002\u305D\u3046\u3067\u306A\u3044\u3068\u3001\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30D5\u30A7\u30C3\u30C1\u3067\u304D\u308B\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5927\u304D\u306A\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C\u9001\u4FE1\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002 \n \u305D\u3046\u306A\u3063\u305F\u5834\u5408\u3001\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306F\u7279\u5B9A\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u306B\u3042\u308B\u5927\u304D\u306A\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30D5\u30A7\u30C3\u30C1\u3057\u3088\u3046\u3068\u3057\u3066\u7ACB\u3061\u5F80\u751F\u3057\u3066\u3057\u307E\u3046\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
SESSION_TIMEOUT_MS.NAME=\u30BB\u30C3\u30B7\u30E7\u30F3\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8(\u30DF\u30EA\u79D2)
SESSION_TIMEOUT_MS.DESCRIPTION=Kafka\u306E\u30B0\u30EB\u30FC\u30D7\u7BA1\u7406\u6A5F\u80FD\u306E\u4F7F\u7528\u306B\u304A\u3044\u3066\u3001\u5931\u6557\u306E\u691C\u51FA\u306B\u4F7F\u308F\u308C\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002
PARTITION_ASSIGNOR.NAME=\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u30A2\u30B5\u30A4\u30CA\u30FC
PARTITION_ASSIGNOR.DESCRIPTION=\u30B0\u30EB\u30FC\u30D7\u7BA1\u7406\u304C\u4F7F\u308F\u308C\u3066\u3044\u308B\u5834\u5408\u306B\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u9593\u3067\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u306E\u6240\u6709\u6A29\u3092\u5206\u6563\u3059\u308B\u305F\u3081\u306B\u4F7F\u3046\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u5272\u308A\u5F53\u3066\u6226\u7565\u306E\u30AF\u30E9\u30B9\u540D\u3002
CONSUMER_REQUEST_TIMEOUT_MS.NAME=\u30EA\u30AF\u30A8\u30B9\u30C8\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8(\u30DF\u30EA\u79D2)
CONSUMER_REQUEST_TIMEOUT_MS.DESCRIPTION=\u3053\u306E\u8A2D\u5B9A\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u5FDC\u7B54\u3092\u5F85\u3064\u6700\u5927\u6642\u9593\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002 \n\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u7D4C\u904E\u3059\u308B\u524D\u306B\u5FDC\u7B54\u304C\u53D7\u4FE1\u3055\u308C\u306A\u3044\u5834\u5408\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u518D\u9001\u4FE1\u3059\u308B\u304B\u3001\u518D\u8A66\u884C\u56DE\u6570\u3092\u4F7F\u3044\u679C\u305F\u3057\u305F\u5834\u5408\u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u5931\u6557\u3055\u305B\u307E\u3059\u3002
BUFFER_MEMORY_SIZE.NAME=\u30D0\u30C3\u30D5\u30A1\u30FC\u30E1\u30E2\u30EA\u30B5\u30A4\u30BA
BUFFER_MEMORY_SIZE.DESCRIPTION=\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u9001\u4FE1\u3092\u5F85\u6A5F\u3057\u3066\u3044\u308B\u30EC\u30B3\u30FC\u30C9\u3092\u30D0\u30C3\u30D5\u30A1\u30EA\u30F3\u30B0\u3059\u308B\u305F\u3081\u306B\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C\u4F7F\u3048\u308B\u30E1\u30E2\u30EA\u306E\u5408\u8A08\u30D0\u30A4\u30C8\u6570\u3002 \n\u30EC\u30B3\u30FC\u30C9\u304C\u30B5\u30FC\u30D0\u30FC\u306B\u914D\u4FE1\u3055\u308C\u308B\u3088\u308A\u3082\u901F\u304F\u9001\u4FE1\u3055\u308C\u305F\u5834\u5408\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306Fblock.on.buffer.full\u3067\u6307\u5B9A\u3055\u308C\u305F\u512A\u5148\u9806\u4F4D\u306B\u57FA\u3065\u3044\u3066\u3001\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u304B\u4F8B\u5916\u3092\u8FD4\u3057\u307E\u3059\u3002 \n\u3053\u306E\u8A2D\u5B9A\u306F\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C\u4F7F\u7528\u3059\u308B\u30E1\u30E2\u30EA\u306E\u7DCF\u91CF\u306B\u307B\u307C\u76F8\u5F53\u3057\u307E\u3059\u304C\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C\u4F7F\u7528\u3059\u308B\u30E1\u30E2\u30EA\u306E\u3059\u3079\u3066\u304C\u30D0\u30C3\u30D5\u30A1\u30EA\u30F3\u30B0\u306B\u4F7F\u7528\u3055\u308C\u308B\u308F\u3051\u3067\u306F\u306A\u3044\u305F\u3081\u3001\u30CF\u30FC\u30C9\u30D0\u30A4\u30F3\u30C9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002 \n\u5727\u7E2E(\u5727\u7E2E\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u5834\u5408)\u304A\u3088\u3073\u5B9F\u884C\u4E2D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u7DAD\u6301\u3059\u308B\u305F\u3081\u3001\u82E5\u5E72\u306E\u8FFD\u52A0\u30E1\u30E2\u30EA\u304C\u4F7F\u308F\u308C\u307E\u3059\u3002
RETRIES.NAME=\u518D\u8A66\u884C
RETRIES.DESCRIPTION=\u30BC\u30ED\u3088\u308A\u5927\u304D\u306A\u5024\u3092\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u6F5C\u5728\u7684\u306B\u4E00\u904E\u6027\u306E\u30A8\u30E9\u30FC\u306B\u3088\u3063\u3066\u9001\u4FE1\u306B\u5931\u6557\u3057\u305F\u30EC\u30B3\u30FC\u30C9\u3092\u3059\u3079\u3066\u518D\u9001\u4FE1\u3059\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002 \n\u3053\u306E\u518D\u8A66\u884C\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30A8\u30E9\u30FC\u3092\u53D7\u3051\u53D6\u3063\u3066\u30EC\u30B3\u30FC\u30C9\u3092\u518D\u9001\u4FE1\u3059\u308B\u5834\u5408\u3068\u9055\u3044\u304C\u3042\u308A\u307E\u305B\u3093\u3002 \n\u78BA\u8A8D\u5FDC\u7B54\u306E\u6210\u529F\u3088\u308A\u524D\u306B\u3001delivery.timeout.ms\u3067\u8A2D\u5B9A\u3055\u308C\u305F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u5207\u308C\u305F\u5834\u5408\u3001\u518D\u8A66\u884C\u56DE\u6570\u304C\u306A\u304F\u306A\u308B\u524D\u306B\u30D7\u30ED\u30C7\u30E5\u30FC\u30B9\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u5931\u6557\u3057\u307E\u3059\u3002\n \u4E00\u822C\u7684\u306B\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u3053\u306E\u8A2D\u5B9A\u3092\u884C\u3046\u4EE3\u308F\u308A\u306B\u3001delivery.timeout.ms\u3092\u4F7F\u3063\u3066\u518D\u8A66\u884C\u306E\u52D5\u4F5C\u3092\u5236\u5FA1\u3059\u308B\u307B\u3046\u304C\u8CE2\u660E\u3067\u3059\u3002 \nidempotence\u3092\u6709\u52B9\u306B\u3059\u308B\u305F\u3081\u306B\u306F\u3001\u3053\u306E\u8A2D\u5B9A\u5024\u30920\u3088\u308A\u5927\u304D\u304F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u8A2D\u5B9A\u304C\u7AF6\u5408\u3057\u3001idempotence\u304C\u660E\u793A\u7684\u306B\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u306A\u3044\u5834\u5408\u3001idempotence\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002 \nenable.idempotence\u3092false\u306B\u8A2D\u5B9A\u3057\u3001max.in.flight.requests.per.connection\u30921\u306B\u8A2D\u5B9A\u3057\u3066\u518D\u8A66\u884C\u3092\u8A31\u53EF\u3059\u308B\u3068\u3001\u30EC\u30B3\u30FC\u30C9\u306E\u9806\u5E8F\u304C\u5909\u308F\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u30012\u3064\u306E\u30D0\u30C3\u30C1\u304C1\u3064\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u306B\u9001\u4FE1\u3055\u308C\u3001 \n\u6700\u521D\u306E\u30D0\u30C3\u30C1\u304C\u5931\u6557\u3057\u3066\u518D\u8A66\u884C\u3055\u308C\u30012\u756A\u76EE\u306E\u30D0\u30C3\u30C1\u304C\u6210\u529F\u3057\u305F\u5834\u5408\u30012\u756A\u76EE\u306E\u30D0\u30C3\u30C1\u306E\u30EC\u30B3\u30FC\u30C9\u304C\u6700\u521D\u306B\u8868\u793A\u3055\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u305F\u3081\u3067\u3059\u3002
PRODUCER_BATCH_SIZE.NAME=\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA
PRODUCER_BATCH_SIZE.DESCRIPTION=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306F\u3001\u8907\u6570\u306E\u30EC\u30B3\u30FC\u30C9\u304C\u540C\u3058\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u306B\u9001\u4FE1\u3055\u308C\u3066\u3044\u308B\u6642\u306F\u5E38\u306B\u3001\u30EC\u30B3\u30FC\u30C9\u3092\u307E\u3068\u3081\u3066\u3088\u308A\u5C11\u306A\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u307E\u3068\u3081\u3088\u3046\u3068\u3057\u307E\u3059\u3002 \n\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u4E21\u65B9\u3067\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u5411\u4E0A\u3057\u307E\u3059\u3002\u3053\u306E\u8A2D\u5B9A\u306F\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u30D0\u30A4\u30C8\u5358\u4F4D\u3067\u5236\u5FA1\u3057\u307E\u3059\u3002 \n\u3053\u306E\u30B5\u30A4\u30BA\u3092\u8D85\u3048\u308B\u30EC\u30B3\u30FC\u30C9\u306E\u30D0\u30C3\u30C1\u51E6\u7406\u306F\u8A66\u307F\u3089\u308C\u307E\u305B\u3093\u3002\u30D6\u30ED\u30FC\u30AB\u30FC\u306B\u9001\u4FE1\u3055\u308C\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u306F\u8907\u6570\u306E\u30D0\u30C3\u30C1\u304C\u542B\u307E\u308C\u3066\u304A\u308A\u3001\u9001\u4FE1\u53EF\u80FD\u306A\u30C7\u30FC\u30BF\u304C\u3042\u308B\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u3054\u3068\u306B1\u3064\u305A\u3064\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002 \n\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u5C0F\u3055\u304F\u3059\u308B\u3068\u3001\u30D0\u30C3\u30C1\u51E6\u7406\u306E\u983B\u5EA6\u304C\u4F4E\u304F\u306A\u308A\u3001\u30B9\u30EB\u30FC\u30D7\u30C3\u30C8\u304C\u4F4E\u4E0B\u3059\u308B\u53EF\u80FD\u6027\u304C\u308A\u307E\u3059(\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u30BC\u30ED\u306B\u3059\u308B\u3068\u30D0\u30C3\u30C1\u51E6\u7406\u306F\u5B8C\u5168\u306B\u7121\u52B9\u306B\u306A\u308A\u307E\u3059)\u3002 \n\u8FFD\u52A0\u30EC\u30B3\u30FC\u30C9\u3092\u898B\u8D8A\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u3092\u5E38\u306B\u78BA\u4FDD\u3067\u304D\u308B\u3088\u3046\u3001\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u304C\u975E\u5E38\u306B\u5927\u304D\u3044\u3068\u30E1\u30E2\u30EA\u3092\u3082\u3046\u5C11\u3057\u6D88\u8CBB\u3057\u3066\u3057\u307E\u3046\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
CONNECTION_MAX_IDLE_MS.NAME=\u63A5\u7D9A\u30A2\u30A4\u30C9\u30EB\u6700\u5927(\u30DF\u30EA\u79D2)
CONNECTION_MAX_IDLE_MS.DESCRIPTION=\u3053\u306E\u8A2D\u5B9A\u306B\u3088\u3063\u3066\u6307\u5B9A\u3055\u308C\u305F\u30DF\u30EA\u79D2\u5F8C\u306B\u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u3092\u9589\u3058\u307E\u3059\u3002
LINGER_MS.NAME=\u30EA\u30F3\u30AC\u30FC(\u30DF\u30EA\u79D2)
LINGER_MS.DESCRIPTION=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u9001\u4FE1\u306E\u9593\u306B\u5230\u7740\u3057\u305F\u5168\u30EC\u30B3\u30FC\u30C9\u30921\u3064\u306E\u30D0\u30C3\u30C1\u3055\u308C\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u307E\u3068\u3081\u307E\u3059\u3002 \n\u901A\u5E38\u3001\u3053\u306E\u73FE\u8C61\u306F\u3001\u30EC\u30B3\u30FC\u30C9\u304C\u9001\u4FE1\u3055\u308C\u308B\u3088\u308A\u3082\u901F\u304F\u53D7\u4FE1\u3055\u308C\u3046\u308B\u3088\u3046\u306A\u8CA0\u8377\u306E\u5834\u5408\u306E\u307F\u767A\u751F\u3057\u307E\u3059\u3002\u305F\u3060\u3057\u72B6\u6CC1\u306B\u3088\u3063\u3066\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u4E2D\u7A0B\u5EA6\u306E\u8CA0\u8377\u3067\u3042\u3063\u3066\u3082\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u3092\u6E1B\u3089\u3057\u305F\u3044\u3068\u601D\u3046\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u3002 \n\u3053\u306E\u8A2D\u5B9A\u3067\u306F\u3001\u308F\u305A\u304B\u306A\u4EBA\u5DE5\u7684\u306A\u30C7\u30A3\u30EC\u30A4\u3092\u52A0\u3048\u308B\u3053\u3068\u3067\u3053\u308C\u3092\u5B9F\u73FE\u3057\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u30EC\u30B3\u30FC\u30C9\u3092\u5373\u5EA7\u306B\u9001\u4FE1\u3059\u308B\u306E\u3067\u306F\u306A\u304F\u3001\u4ED6\u306E\u30EC\u30B3\u30FC\u30C9\u304C\u9001\u4FE1\u3055\u308C\u308B\u306E\u3092\u5F85\u3064\u305F\u3081\u306B\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306F\u6307\u5B9A\u3055\u308C\u305F\u9045\u5EF6\u6642\u9593\u304C\u7D4C\u904E\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u307E\u3059\u3002 \n\u3053\u308C\u306F\u3001TCP\u306B\u304A\u3051\u308BNagle\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306B\u985E\u4F3C\u3057\u3066\u3044\u308B\u3068\u8003\u3048\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u8A2D\u5B9A\u306B\u3088\u3063\u3066\u30D0\u30C3\u30C1\u51E6\u7406\u306E\u9045\u5EF6\u306E\u4E0A\u9650\u304C\u6C7A\u5B9A\u3057\u307E\u3059: \n\u3042\u308B\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u3067batch.size\u306B\u76F8\u5F53\u3059\u308B\u30EC\u30B3\u30FC\u30C9\u3092\u53D6\u5F97\u3059\u308B\u3068\u3001\u305D\u306E\u30EC\u30B3\u30FC\u30C9\u306F\u3053\u306E\u8A2D\u5B9A\u306B\u95A2\u4FC2\u306A\u304F\u5373\u5EA7\u306B\u9001\u4FE1\u3055\u308C\u307E\u3059\u304C\u3001\u3053\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u3067\u84C4\u7A4D\u3055\u308C\u305F\u30D0\u30A4\u30C8\u6570\u304C\u3053\u308C\u3088\u308A\u5C11\u306A\u3044\u5834\u5408\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F\u6642\u9593\u3060\u3051\u3001\u30EC\u30B3\u30FC\u30C9\u304C\u3055\u3089\u306B\u8868\u793A\u3055\u308C\u308B\u307E\u3067\u306E\u300C\u5F85\u3061\u6642\u9593\u300D\u304C\u767A\u751F\u3057\u307E\u3059\u3002 \n\u3053\u306E\u8A2D\u5B9A\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u306F0 (\u3064\u307E\u308A\u9045\u5EF6\u306A\u3057)\u3067\u3059\u3002\u305F\u3068\u3048\u3070linger.ms=5\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u9001\u4FE1\u3055\u308C\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6570\u306F\u6E1B\u308A\u307E\u3059\u304C\u3001\u8CA0\u8377\u304C\u306A\u3044\u6642\u306B\u9001\u4FE1\u3055\u308C\u308B\u30EC\u30B3\u30FC\u30C9\u306B\u6700\u59275\u30DF\u30EA\u79D2\u306E\u9045\u5EF6\u304C\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
MAX_BLOCK_MS.NAME=\u6700\u5927\u30D6\u30ED\u30C3\u30AF(\u30DF\u30EA\u79D2)
MAX_BLOCK_MS.DESCRIPTION=\u3053\u306E\u8A2D\u5B9A\u306F\u3001KafkaProducer\u306E send()\u3001partitionsFor()\u3001initTransactions()\u3001sendOffsetsToTransaction()\u3001commitTransaction()\u3001abortTransaction()\u3068\u3044\u3046\u5404\u30E1\u30BD\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u308B\u6642\u9593\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002 \nsend()\u306E\u5834\u5408\u3001\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306F\u3001\u30E1\u30BF\u30C7\u30FC\u30BF\u30D5\u30A7\u30C3\u30C1\u3068\u30D0\u30C3\u30D5\u30A1\u30FC\u5272\u308A\u5F53\u3066\u306E\u4E21\u65B9\u306E\u5F85\u3061\u6642\u9593\u306E\u5408\u8A08\u306E\u5883\u754C\u3068\u306A\u308A\u307E\u3059(\u30E6\u30FC\u30B6\u30FC\u304C\u63D0\u4F9B\u3059\u308B\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u30FC\u3084\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30CA\u30FC\u3067\u306E\u30D6\u30ED\u30C3\u30AF\u306F\u3001\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306B\u306F\u30AB\u30A6\u30F3\u30C8\u3055\u308C\u308C\u307E\u305B\u3093)\u3002 \npartitionsFor()\u306E\u5834\u5408\u3001\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306F\u3001\u30E1\u30BF\u30C7\u30FC\u30BF\u304C\u5229\u7528\u3067\u304D\u306A\u3044\u6642\u306B\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u5F85\u3064\u6642\u9593\u306E\u5883\u754C\u3068\u306A\u308A\u307E\u3059\u3002 \n\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u95A2\u9023\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u5E38\u306B\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3059\u304C\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7 \u30F3\u30B3\u30FC\u30C7\u30A3\u30CD\u30FC\u30BF\u30FC\u3092\u767A\u898B\u3067\u304D\u306A\u304B\u3063\u305F\u308A\u3001\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u6642\u9593\u5185\u306B\u5FDC\u7B54\u3057\u306A \u304B\u3063\u305F\u308A\u3059\u308B\u3068\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
MAX_REQUEST_SIZE.NAME=\u6700\u5927\u30EA\u30AF\u30A8\u30B9\u30C8\u30B5\u30A4\u30BA
MAX_REQUEST_SIZE.DESCRIPTION=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u30B5\u30A4\u30BA\u3002\u3053\u308C\u306F\u4E8B\u5B9F\u4E0A\u3001\u6700\u5927\u30EC\u30B3\u30FC\u30C9\u30B5\u30A4\u30BA\u306E\u4E0A\u9650\u3067\u3082\u3042\u308A\u307E\u3059\u3002 \n\u30B5\u30FC\u30D0\u30FC\u306B\u306F\u30EC\u30B3\u30FC\u30C9\u30B5\u30A4\u30BA\u306E\u4E0A\u9650\u304C\u3042\u308B\u305F\u3081\u3001\u3053\u308C\u3068\u306F\u7570\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002 \n\u3053\u306E\u8A2D\u5B9A\u306B\u3088\u308A\u3001\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u304C1\u3064\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3067\u9001\u4FE1\u3059\u308B\u30EC\u30B3\u30FC\u30C9\u30D0\u30C3\u30C1\u306E\u6570\u304C\u5236\u9650\u3055\u308C\u3001\u5927\u91CF\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u9001\u4FE1\u304C\u56DE\u907F\u3055\u308C\u307E\u3059\u3002
RECEIVE_BUFFER_BYTES.NAME=\u53D7\u4FE1\u30D0\u30C3\u30D5\u30A1(\u30D0\u30A4\u30C8)
RECEIVE_BUFFER_BYTES.DESCRIPTION=\u30C7\u30FC\u30BF\u3092\u8AAD\u307F\u53D6\u308B\u6642\u306B\u4F7F\u7528\u3059\u308BTCP\u53D7\u4FE1\u30D0\u30C3\u30D5\u30A1\u30FC(SO_RCVBUF)\u306E\u30B5\u30A4\u30BA\u3002
MAX_IN_FLIGHT_REQUEST.NAME=\u30D5\u30E9\u30A4\u30C8\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927
MAX_IN_FLIGHT_REQUEST.DESCRIPTION=\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u524D\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5358\u4E00\u306E\u63A5\u7D9A\u3067\u9001\u4FE1\u3059\u308B\u672A\u78BA\u8A8D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u6570\u3002 \n\u3053\u306E\u8A2D\u5B9A\u304C1\u3088\u308A\u5927\u304D\u3044\u5024\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u304A\u308A\u3001(\u9001\u4FE1\u304C\u5931\u6557\u3057\u305F\u5834\u5408\u306A\u3069\u306B)\u518D\u8A66\u884C\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u3068\u3001\u305D\u306E\u518D\u8A66\u884C\u304C\u539F\u56E0\u3067\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u518D\u914D\u5217\u3055\u308C\u308B\u30EA\u30B9\u30AF\u304C\u3042\u308A\u307E\u3059\u3002
METADATA_MAX_AGE_MS.NAME=\u30E1\u30BF\u30C7\u30FC\u30BF\u6700\u5927\u671F\u9593(\u30DF\u30EA\u79D2)
METADATA_MAX_AGE_MS.DESCRIPTION=\u65B0\u3057\u3044\u30D6\u30ED\u30FC\u30AB\u30FC\u3084\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u3092\u672A\u7136\u306B\u767A\u898B\u3067\u304D\u308B\u3088\u3046\u3001\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u30EA\u30FC\u30C0\u30FC\u30B7\u30C3\u30D7\u306E\u5909\u66F4\u304C\u306A\u304B\u3063\u305F\u3068\u3057\u3066\u3082\u30E1\u30BF\u30C7\u30FC\u30BF\u306E\u66F4\u65B0\u3092\u5F37\u5236\u3059\u308B\u6642\u9593(\u30DF\u30EA\u79D2)\u3002
RECONNECT_BACKOFF_MS.NAME=\u518D\u63A5\u7D9A\u30D0\u30C3\u30AF\u30AA\u30D5(\u30DF\u30EA\u79D2)
RECONNECT_BACKOFF_MS.DESCRIPTION=\u6307\u5B9A\u3055\u308C\u305F\u30DB\u30B9\u30C8\u3078\u306E\u518D\u63A5\u7D9A\u3092\u8A66\u307F\u308B\u307E\u3067\u306E\u5F85\u3061\u6642\u9593\u3002\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u30BF\u30A4\u30C8\u306A\u30EB\u30FC\u30D7\u3067\u7E70\u308A\u8FD4\u3057\u30DB\u30B9\u30C8\u306B\u63A5\u7D9A\u3059\u308B\u3053\u3068\u3092\u907F\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002 \n\u3053\u306E\u30D0\u30C3\u30AF\u30AA\u30D5\u306F\u3001\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30D6\u30ED\u30FC\u30AB\u30FC\u306B\u9001\u308B\u3059\u3079\u3066\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306B \u9069\u7528\u3055\u308C\u307E\u3059\u3002
URI_OPTIONS.DESCRIPTION=Kafka\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
USE_SCHEMA_REGISTRY.NAME=\u30B9\u30AD\u30FC\u30DE\u30EC\u30B8\u30B9\u30C8\u30EA\u30FC\u3092\u4F7F\u7528
SCHEMA_REGISTRY_URL.NAME=Schema Registry URL
SCHEMA_REGISTRY_URL.DESCRIPTION=\u4F7F\u7528\u3059\u308BConfluent Platform\u30B9\u30AD\u30FC\u30DE\u30EC\u30B8\u30B9\u30C8\u30EA\u30B5\u30FC\u30D0\u30FC\u306E URL\u3002\u5F62\u5F0F\u306Fhost1:port1,host2:port2\u3068\u306A\u308A\u307E\u3059\u3002 \n\u3053\u308C\u306F\u3001Confluent Platform\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C6\u30FC\u30B7\u30E7\u30F3\u3067\u306Fschema.registry.url\u3068\u3057\u3066\u77E5\u3089\u308C\u3066\u3044\u307E\u3059\u3002 \n\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306FConfluent Platform\u3067\u306E\u307F\u5229\u7528\u53EF\u80FD\u3067\u3059(\u6A19\u6E96\u306EApache Kafka\u3067\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093)\u3002
